In [1]:
import json
from transformers import AutoTokenizer, AutoModelForCausalLM
import torch
import sqlite3
import os

# os.environ["CUDA_VISIBLE_DEVICES"] = "0,1"
tokenizer = AutoTokenizer.from_pretrained(
    "../deepseek-coder-33b-instruct", trust_remote_code=True
)
model = AutoModelForCausalLM.from_pretrained(
    "../deepseek-coder-33b-instruct",
    trust_remote_code=True,
    torch_dtype=torch.bfloat16,
).cuda()

Spider_Dataset_Path = "../dataset/spider/"
Dev_Json_Path = Spider_Dataset_Path + "dev.json"
Database_Path = Spider_Dataset_Path + "database/"

Special tokens have been added in the vocabulary, make sure the associated word embeddings are fine-tuned or trained.

Loading checkpoint shards:   0%|          | 0/7 [00:00<?, ?it/s]

:

:

In [3]:
# 连接到 SQLite 数据库
def get_schema_str(db_id: str):
    db_path = "../dataset/spider/database/{db_id}/{db_id}.sqlite".format(db_id=db_id)
    conn = sqlite3.connect(db_path)

    # 创建游标对象
    cursor = conn.cursor()

    # 执行查询获取表的模式信息
    cursor.execute("SELECT sql FROM sqlite_master WHERE type='table'")

    # 获取查询结果
    results = cursor.fetchall()

    # # 打印表的模式信息
    # # schema = "```sql\n"
    schema=""
    for result in results:
        schema += result[0].lower() + ";\n"
    # schema+="```\n"
    # 关闭连接
    conn.close()

    return schema

In [33]:
import re
from process_sql import tokenize, get_schema, get_tables_with_alias, Schema, get_sql

pattern = re.compile(r"```sql (.+) ```", re.S)

# \nComplete .
system_prompt = "### Instruction:\nGiven the following SQLite database schema:\n"

# shots=""
# shots = "### Output format rule\nYour answer should only contains sql query in one line in plain text(no markdown format), without any other natrual language. Please follow this rule which is important for me.\n\n"


def is_valid(db_id: str, answer: str):
    db_path = "../dataset/spider/database/{db_id}/{db_id}.sqlite".format(db_id=db_id)
    schema = Schema(get_schema(db_path))
    try:
        p_sql = get_sql(schema, answer)
        return True
    except Exception as e:
        print("invalid")
        print(e)
        return False


def text2sql(
    schema: str,
    question: str,
):
    # conversation = [
    #     {"role": "system", "content": system_prompt+schema},
    #     # {"role": "user", "content": "### Complete sqlite SQL query only and with no explanation \n ### Sqlite SQL tables, with their properties: \n# \n# stadium(Stadium_ID,Location,Name,Capacity,Highest,Lowest,Average)\n;# singer(Singer_ID,Name,Country,Song_Name,Song_release_year,Age,Is_male)\n;# concert(concert_ID,concert_Name,Theme,Stadium_ID,Year)\n;# singer_in_concert(concert_ID,Singer_ID)\n.# \n ### How many singers do we have? \n SELECT"},
    #     # {"role": "system", "content": schema},
    #     {"role": "user", "content": question+"\nSELECT"},
    # ]
    conversation = (
        system_prompt
        + schema
        + "Complete the SQLite SQL query only to answer this question and with no explanation: "
        + question
        + "\n### Response:\nSELECT"
    )
    # print(conversation)
    # print(conv)
    input_text = tokenizer(conversation, return_tensors="pt").to(model.device)
    # input_text = tokenizer.apply_chat_template(conversation, return_tensors="pt").to(model.device)  # type: ignore

    outputs = model.generate(
        **input_text,
        # temperature=1.0,
        # do_sample=True,
        max_new_tokens=512,
        # repetition_penalty=1.5,
        pad_token_id=0,
        bos_token_id=32013,
        eos_token_id=32021,
    )
    # [len(input_text[0]) :]
    answer = tokenizer.decode(
        outputs[0], skip_special_tokens=True
    )
    return answer


fo = open("result.txt", "w")


with open(Dev_Json_Path, "r") as dataset_file:
    i = 0
    dataset = json.load(dataset_file)
    for test_case in dataset[:]:
        i = i + 1
        db_id = test_case["db_id"]
        question = test_case["question"]

        answer = text2sql(get_schema_str(db_id), question)
        # print(answer)

        answer = "SELECT" + answer.replace("\n", " ")
        answer = " ".join(answer.split())
        answer = answer[: answer.find(";") + 1]
        print(answer)
        break
        # continue
        # sql = pattern.findall(answer)
        # if len(sql) > 0:
        #     formatted_answer = sql[0]

        # else:
        #     formatted_answer = answer
        # print(formatted_answer)
        # print(is_valid(db_id, formatted_answer))
        fo.write(answer + "\n")
        # break
        # if i > 10:
        #     break
# 关闭打开的文件
fo.close()

SELECT COUNT(*) FROM singer;
SELECT COUNT(*) FROM singer;
SELECT name, country, age FROM singer ORDER BY age DESC;
SELECT name, country, age FROM singer ORDER BY age DESC;
SELECT AVG(age), MIN(age), MAX(age) FROM singer WHERE country = 'France';
SELECT AVG(age), MIN(age), MAX(age) FROM singer WHERE country = 'France';
SELECT s.name, s.song_release_year FROM singer s WHERE s.age = ( SELECT MIN(age) FROM singer );
SELECT s.name, s.song_name, s.song_release_year FROM singer s WHERE s.age = ( SELECT MIN(s2.age) FROM singer s2 );
SELECT DISTINCT country FROM singer WHERE age > 20;
SELECT DISTINCT s.country FROM singer s WHERE s.age > 20;
SELECT s.country, COUNT(*) as num_singers FROM singer s JOIN singer_in_concert sic ON s.singer_id = sic.singer_id GROUP BY s.country;
SELECT s.country, COUNT(s.singer_id) as singer_count FROM singer s JOIN singer_in_concert sic ON s.singer_id = sic.singer_id GROUP BY s.country;
SELECT s.name, s.song_name FROM singer s JOIN ( SELECT singer_id FROM singer WHERE age > ( SELECT AVG(age) FROM singer ) ) avg_age ON s.singer_id = avg_age.singer_id;
SELECT s.name, s.song_name FROM singer s JOIN singer_in_concert sic ON s.singer_id = sic.singer_id JOIN concert c ON sic.concert_id = c.concert_id JOIN stadium st ON c.stadium_id = st.stadium_id WHERE s.age > (SELECT AVG(age) FROM singer) AND s.is_male = 1;
SELECT location, name FROM stadium WHERE capacity BETWEEN 5000 AND 10000;
SELECT location, name FROM stadium WHERE capacity BETWEEN 5000 AND 10000;
SELECT MAX(capacity), AVG(capacity) FROM stadium;
SELECT AVG(capacity) as average_capacity, MAX(capacity) as maximum_capacity FROM stadium;
SELECT name, capacity FROM stadium WHERE average = (SELECT MAX(average) FROM stadium);
SELECT name, capacity FROM stadium WHERE average = (SELECT MAX(average) FROM stadium);
SELECT COUNT(*) FROM concert WHERE year IN ('2014', '2015');
SELECT COUNT(*) FROM concert WHERE year IN ('2014', '2015');
SELECT s.name, COUNT(c.concert_id) as num_concerts FROM stadium s JOIN concert c ON s.stadium_id = c.stadium_id GROUP BY s.name;
SELECT s.stadium_id, s.name, COUNT(c.concert_id) as num_concerts FROM stadium s JOIN concert c ON s.stadium_id = c.stadium_id GROUP BY s.stadium_id, s.name;
SELECT s.name, s.capacity FROM stadium s JOIN concert c ON s.stadium_id = c.stadium_id WHERE c.year >= '2014' GROUP BY s.stadium_id ORDER BY COUNT(c.concert_id) DESC LIMIT 1;
SELECT s.name, s.capacity FROM stadium s JOIN concert c ON s.stadium_id = c.stadium_id WHERE c.year > 2013 GROUP BY s.stadium_id ORDER BY COUNT(c.concert_id) DESC LIMIT 1;
SELECT year, COUNT(*) as num_concerts FROM concert GROUP BY year ORDER BY num_concerts DESC LIMIT 1;
SELECT year, COUNT(*) as num_concerts FROM concert GROUP BY year ORDER BY num_concerts DESC LIMIT 1;
SELECT s.name FROM stadium s LEFT JOIN concert c ON s.stadium_id = c.stadium_id WHERE c.concert_id IS NULL;
SELECT name FROM stadium WHERE stadium_id NOT IN (SELECT DISTINCT stadium_id FROM concert);
SELECT DISTINCT s1.country FROM singer s1, singer s2 WHERE s1.age > 40 AND s2.age < 30 AND s1.country = s2.country;
SELECT name FROM stadium WHERE stadium_id NOT IN (SELECT stadium_id FROM concert WHERE year = '2014');
SELECT name FROM stadium WHERE stadium_id NOT IN (SELECT stadium_id FROM concert WHERE year = '2014');
SELECT c.concert_name, c.theme, COUNT(sic.singer_id) as num_singers FROM concert c JOIN singer_in_concert sic ON c.concert_id = sic.concert_id GROUP BY c.concert_id;
SELECT c.concert_name, c.theme, COUNT(sic.singer_id) as num_singers FROM concert c JOIN singer_in_concert sic ON c.concert_id = sic.concert_id GROUP BY c.concert_id;
SELECT s.name, COUNT(sc.concert_id) as num_concerts FROM singer s JOIN singer_in_concert sc ON s.singer_id = sc.singer_id GROUP BY s.singer_id;
SELECT s.name, COUNT(sc.concert_id) as num_concerts FROM singer s JOIN singer_in_concert sc ON s.singer_id = sc.singer_id GROUP BY s.name;
SELECT s.name FROM singer s JOIN singer_in_concert sic ON s.singer_id = sic.singer_id JOIN concert c ON sic.concert_id = c.concert_id WHERE c.year = '2014';
SELECT s.name FROM singer s JOIN singer_in_concert sic ON s.singer_id = sic.singer_id JOIN concert c ON sic.concert_id = c.concert_id WHERE c.year = '2014';
SELECT name, country FROM singer WHERE song_name LIKE '%Hey%';
SELECT name, country FROM singer WHERE song_name LIKE '%Hey%';
SELECT name, location FROM stadium WHERE stadium_id IN ( SELECT stadium_id FROM concert WHERE year = '2014' INTERSECT SELECT stadium_id FROM concert WHERE year = '2015' );
SELECT s.name, s.location FROM stadium s WHERE s.stadium_id IN ( SELECT c1.stadium_id FROM concert c1 WHERE c1.year = '2014' ) AND s.stadium_id IN ( SELECT c2.stadium_id FROM concert c2 WHERE c2.year = '2015' );
SELECT COUNT(*) FROM concert WHERE stadium_id = ( SELECT stadium_id FROM stadium ORDER BY capacity DESC LIMIT 1 );
SELECT COUNT(*) FROM concert WHERE stadium_id = ( SELECT stadium_id FROM stadium ORDER BY capacity DESC LIMIT 1 );
SELECT COUNT(*) FROM pets WHERE weight > 10;
SELECT COUNT(*) FROM pets WHERE weight > 10;
SELECT MIN(weight) FROM pets WHERE pettype = 'dog';
SELECT MIN(weight) FROM pets WHERE pettype = 'dog';
SELECT pettype, MAX(weight) as max_weight FROM pets GROUP BY pettype;
SELECT pettype, MAX(weight) FROM pets GROUP BY pettype;
SELECT COUNT(*) FROM student JOIN has_pet ON student.stuid = has_pet.stuid WHERE student.age > 20;
SELECT COUNT(*) FROM has_pet JOIN student ON has_pet.stuid = student.stuid WHERE student.age > 20;
SELECT COUNT(*) FROM has_pet JOIN pets ON has_pet.petid = pets.petid JOIN student ON has_pet.stuid = student.stuid WHERE pets.pettype = 'dog' AND student.sex = 'F';
SELECT COUNT(*) FROM student JOIN has_pet ON student.stuid = has_pet.stuid JOIN pets ON has_pet.petid = pets.petid WHERE student.sex = 'F' AND pets.pettype = 'Dog';
SELECT COUNT(DISTINCT pettype) FROM pets;
SELECT COUNT(DISTINCT pettype) FROM pets;
SELECT DISTINCT s.fname FROM student s JOIN has_pet hp ON s.stuid = hp.stuid JOIN pets p ON hp.petid = p.petid WHERE p.pettype IN ('cat', 'dog');
SELECT DISTINCT s.fname FROM student s JOIN has_pet hp ON s.stuid = hp.stuid JOIN pets p ON hp.petid = p.petid WHERE p.pettype IN ('cat', 'dog');
SELECT s.fname FROM student s JOIN has_pet hp1 ON s.stuid = hp1.stuid JOIN pets p1 ON hp1.petid = p1.petid JOIN has_pet hp2 ON s.stuid = hp2.stuid JOIN pets p2 ON hp2.petid = p2.petid WHERE p1.pettype = 'cat' AND p2.pettype = 'dog' LIMIT 1;
SELECT s.fname FROM student s JOIN has_pet hp1 ON s.stuid = hp1.stuid JOIN pets p1 ON hp1.petid = p1.petid JOIN has_pet hp2 ON s.stuid = hp2.stuid JOIN pets p2 ON hp2.petid = p2.petid WHERE p1.pettype = 'cat' AND p2.pettype = 'dog';

SELECT student.stuid, student.age, student.major FROM student LEFT JOIN has_pet ON student.stuid = has_pet.stuid LEFT JOIN pets ON has_pet.petid = pets.petid WHERE pets.pettype != 'cat' OR pets.pettype IS NULL;
SELECT stuid FROM student WHERE stuid NOT IN ( SELECT stuid FROM has_pet INNER JOIN pets ON has_pet.petid = pets.petid WHERE pettype = 'cat' );
SELECT stuid FROM student WHERE stuid NOT IN (SELECT stuid FROM has_pet INNER JOIN pets ON has_pet.petid = pets.petid WHERE pettype = 'cat');
SELECT fname, age FROM student INNER JOIN has_pet ON student.stuid = has_pet.stuid INNER JOIN pets ON has_pet.petid = pets.petid WHERE pets.pettype = 'dog' AND NOT EXISTS (SELECT 1 FROM pets WHERE pettype = 'cat' AND student.stuid = has_pet.stuid);
SELECT s.fname FROM student s JOIN has_pet hp ON s.stuid = hp.stuid JOIN pets p ON hp.petid = p.petid WHERE p.pettype = 'dog' AND NOT EXISTS ( SELECT 1 FROM has_pet hp2 JOIN pets p2 ON hp2.petid = p2.petid WHERE hp2.stuid = s.stuid AND p2.pettype = 'cat' );
SELECT pettype, weight FROM pets WHERE pet_age = (SELECT MIN(pet_age) FROM pets);
SELECT pettype, pet_age, weight FROM pets WHERE pet_age = (SELECT MIN(pet_age) FROM pets) AND weight = (SELECT MIN(weight) FROM pets);
SELECT petid, weight FROM pets WHERE pet_age > 1;
SELECT petid, weight FROM pets WHERE pet_age > 1;
SELECT p.pettype, AVG(p.pet_age) as average_age, MAX(p.pet_age) as max_age FROM pets p GROUP BY p.pettype;
SELECT pettype, AVG(pet_age) as average_age, MAX(pet_age) as max_age FROM pets GROUP BY pettype;
SELECT pettype, AVG(weight) FROM pets GROUP BY pettype;
SELECT pettype, AVG(weight) FROM pets GROUP BY pettype;
SELECT s.fname, s.age FROM student s INNER JOIN has_pet h ON s.stuid = h.stuid;
SELECT DISTINCT fname, age FROM student INNER JOIN has_pet ON student.stuid = has_pet.stuid;
SELECT petid FROM has_pet INNER JOIN student ON has_pet.stuid = student.stuid WHERE student.lname = 'Smith';
SELECT petid FROM has_pet INNER JOIN student ON has_pet.stuid = student.stuid WHERE student.lname = 'Smith';
SELECT stuid, COUNT(petid) as num_pets FROM has_pet GROUP BY stuid;
SELECT stuid, COUNT(petid) as num_pets FROM has_pet GROUP BY stuid;
SELECT fname, sex FROM student JOIN has_pet ON student.stuid = has_pet.stuid GROUP BY student.stuid HAVING COUNT(has_pet.petid) > 1;
SELECT fname, sex FROM student WHERE stuid IN ( SELECT stuid FROM has_pet GROUP BY stuid HAVING COUNT(petid) > 1 );
SELECT s.lname FROM student s JOIN has_pet hp ON s.stuid = hp.stuid JOIN pets p ON hp.petid = p.petid WHERE p.pettype = 'cat' AND p.pet_age = 3 ORDER BY s.stuid DESC LIMIT 1;
SELECT s.lname FROM student s JOIN has_pet hp ON s.stuid = hp.stuid JOIN pets p ON hp.petid = p.petid WHERE p.pettype = 'cat' AND p.pet_age = 3 ORDER BY s.lname DESC LIMIT 1;
SELECT AVG(age) FROM student WHERE stuid NOT IN (SELECT stuid FROM has_pet);
SELECT AVG(age) FROM student WHERE stuid NOT IN (SELECT stuid FROM has_pet);
SELECT COUNT(DISTINCT contid) FROM continents;
SELECT COUNT(DISTINCT contid) FROM continents;
SELECT c.contid, c.continent, COUNT(co.countryid) AS num_countries FROM continents c JOIN countries co ON c.contid = co.continent GROUP BY c.contid;
SELECT c.contid, c.continent, COUNT(co.countryname) AS country_count FROM continents c JOIN countries co ON c.contid = co.continent GROUP BY c.contid;
SELECT COUNT(*) FROM countries;
SELECT COUNT(*) FROM countries;
SELECT car_makers.fullname, car_makers.id, COUNT(model_list.model) as num_models FROM car_makers JOIN countries ON car_makers.country = countries.countryid JOIN continents ON countries.continent = continents.contid JOIN model_list ON car_makers.id = model_list.maker GROUP BY car_makers.id;
SELECT car_makers.id, car_makers.fullname, COUNT(model_list.model) as models_count FROM car_makers JOIN countries ON car_makers.country = countries.countryid JOIN continents ON countries.continent = continents.contid JOIN model_list ON car_makers.id = model_list.maker GROUP BY car_makers.id;
SELECT m.model FROM model_list m JOIN car_makers cm ON m.maker = cm.id JOIN countries c ON cm.country = c.countryid JOIN continents cont ON c.continent = cont.contid JOIN car_names cn ON m.modelid = cn.makeid JOIN cars_data cd ON cn.makeid = cd.id ORDER BY cd.horsepower ASC LIMIT 1;
SELECT m.model FROM model_list m JOIN car_names cn ON m.maker = cn.make JOIN cars_data cd ON cn.makeid = cd.id ORDER BY cd.horsepower ASC LIMIT 1;
SELECT model FROM car_names INNER JOIN cars_data ON car_names.makeid = cars_data.id WHERE weight < (SELECT AVG(weight) FROM cars_data);
SELECT model FROM car_names INNER JOIN model_list ON car_names.model = model_list.model INNER JOIN cars_data ON car_names.makeid = cars_data.id WHERE cars_data.weight < (SELECT AVG(weight) FROM cars_data);
SELECT DISTINCT car_makers.maker FROM car_makers JOIN countries ON car_makers.country = countries.countryid JOIN continents ON countries.continent = continents.contid JOIN car_names ON car_makers.id = car_names.makeid JOIN cars_data ON car_names.makeid = cars_data.id WHERE cars_data.year = 1970;
SELECT DISTINCT car_makers.maker FROM car_makers JOIN countries ON car_makers.country = countries.countryid JOIN continents ON countries.continent = continents.contid JOIN car_names ON car_makers.id = car_names.makeid JOIN model_list ON car_names.model = model_list.modelid JOIN cars_data ON car_names.makeid = cars_data.id WHERE cars_data.year = 1970;
SELECT cn.make, cd.year FROM car_names cn JOIN cars_data cd ON cn.makeid = cd.id WHERE cd.year = (SELECT MIN(year) FROM cars_data);
SELECT car_makers.maker, MIN(cars_data.year) FROM car_makers JOIN countries ON car_makers.country = countries.countryid JOIN continents ON countries.continent = continents.contid JOIN car_names ON car_makers.id = car_names.maker JOIN model_list ON car_names.model = model_list.modelid JOIN cars_data ON car_names.makeid = cars_data.id WHERE continents.continent = 'Europe';
SELECT DISTINCT model FROM car_names INNER JOIN cars_data ON car_names.makeid = cars_data.id WHERE cars_data.year > 1980;
SELECT DISTINCT model_list.model FROM model_list JOIN car_makers ON model_list.maker = car_makers.id JOIN car_names ON model_list.modelid = car_names.makeid JOIN cars_data ON car_names.makeid = cars_data.id WHERE cars_data.year > 1980;
SELECT c.continent, COUNT(cm.id) as car_makers_count FROM continents c JOIN countries co ON c.contid = co.continent JOIN car_makers cm ON co.countryid = cm.country GROUP BY c.continent;
SELECT c.continent, COUNT(cm.id) AS car_makers_count FROM continents c JOIN countries co ON c.contid = co.continent JOIN car_makers cm ON co.countryid = cm.country GROUP BY c.contid;
SELECT countries.countryname, COUNT(car_makers.country) as car_makers_count FROM countries JOIN car_makers ON countries.countryid = car_makers.country GROUP BY countries.countryname ORDER BY car_makers_count DESC LIMIT 1;
SELECT countries.countryname, COUNT(car_makers.country) as car_makers_count FROM countries JOIN car_makers ON countries.countryid = car_makers.country GROUP BY countries.countryname ORDER BY car_makers_count DESC LIMIT 1;
SELECT car_makers.fullname, COUNT(model_list.model) as model_count FROM car_makers JOIN countries ON car_makers.country = countries.countryid JOIN continents ON countries.continent = continents.contid JOIN model_list ON car_makers.id = model_list.maker GROUP BY car_makers.fullname;
SELECT car_makers.id, car_makers.fullname, COUNT(model_list.model) as num_models FROM car_makers JOIN countries ON car_makers.country = countries.countryid JOIN continents ON countries.continent = continents.contid JOIN car_names ON car_makers.id = car_names.makeid JOIN model_list ON car_names.model = model_list.modelid GROUP BY car_makers.id;
SELECT cars_data.accelerate FROM cars_data INNER JOIN car_names ON cars_data.makeid = car_names.makeid INNER JOIN model_list ON car_names.model = model_list.model INNER JOIN car_makers ON model_list.maker = car_makers.id WHERE car_makers.maker = 'amc' AND car_names.make = 'hornet' AND car_names.model = 'sportabout (sw)';
SELECT cars_data.accelerate FROM cars_data INNER JOIN car_names ON cars_data.makeid = car_names.makeid INNER JOIN model_list ON car_names.model = model_list.model INNER JOIN car_makers ON model_list.maker = car_makers.id WHERE car_makers.maker = 'amc' AND car_names.make = 'hornet' AND car_names.model = 'sportabout (sw)';
SELECT COUNT(*) FROM car_makers WHERE country = (SELECT countryid FROM countries WHERE countryname = 'France');
SELECT COUNT(DISTINCT car_makers.id) FROM car_makers JOIN countries ON car_makers.country = countries.countryid JOIN continents ON countries.continent = continents.contid WHERE continents.continent = 'France';
SELECT COUNT(*) FROM model_list JOIN car_makers ON model_list.maker = car_makers.id WHERE car_makers.country = (SELECT countryid FROM countries WHERE countryname = 'usa');
SELECT COUNT(*) FROM model_list JOIN car_makers ON model_list.maker = car_makers.id JOIN countries ON car_makers.country = countries.countryid WHERE countries.countryname = 'United States';
SELECT AVG(mpg) FROM cars_data WHERE cylinders = 4;
SELECT AVG(mpg) FROM cars_data WHERE cylinders = 4;
SELECT MIN(weight) FROM cars_data JOIN car_names ON cars_data.makeid = car_names.makeid JOIN model_list ON car_names.model = model_list.model JOIN car_makers ON model_list.maker = car_makers.id WHERE cars_data.cylinders = 8 AND cars_data.year = 1974;
SELECT MIN(weight) FROM cars_data JOIN car_names ON cars_data.makeid = car_names.makeid WHERE cylinders = 8 AND year = 1974;
SELECT car_makers.maker, model_list.model FROM car_makers JOIN countries ON car_makers.country = countries.countryid JOIN continents ON countries.continent = continents.contid JOIN model_list ON car_makers.id = model_list.maker JOIN car_names ON model_list.modelid = car_names.makeid;
SELECT car_makers.maker, model_list.model FROM car_makers JOIN countries ON car_makers.country = countries.countryid JOIN continents ON countries.continent = continents.contid JOIN model_list ON car_makers.id = model_list.maker JOIN car_names ON model_list.modelid = car_names.makeid;
SELECT countries.countryname, countries.countryid FROM countries JOIN car_makers ON countries.countryid = car_makers.country GROUP BY countries.countryid;
SELECT countries.countryid, countries.countryname FROM countries JOIN car_makers ON countries.countryid = car_makers.country GROUP BY countries.countryid HAVING COUNT(car_makers.id) > 0;
SELECT COUNT(*) FROM cars_data INNER JOIN car_names ON cars_data.makeid = car_names.makeid INNER JOIN model_list ON car_names.model = model_list.model INNER JOIN car_makers ON model_list.maker = car_makers.id WHERE cars_data.horsepower > 150;
SELECT COUNT(*) FROM cars_data INNER JOIN car_names ON cars_data.makeid = car_names.makeid INNER JOIN model_list ON car_names.model = model_list.model INNER JOIN car_makers ON model_list.maker = car_makers.id WHERE cars_data.horsepower > 150;
SELECT year, AVG(weight) as average_weight FROM cars_data GROUP BY year;
SELECT year, AVG(weight) as average_weight FROM cars_data GROUP BY year;
SELECT c.countryname FROM countries c JOIN car_makers cm ON c.countryid = cm.country WHERE c.continent = ( SELECT contid FROM continents WHERE continent = 'Europe' ) GROUP BY c.countryname HAVING COUNT(cm.id) >= 3;
SELECT c.countryname FROM countries c JOIN car_makers cm ON c.countryid = cm.country GROUP BY c.countryname HAVING COUNT(cm.id) >= 3 AND c.continent = (SELECT contid FROM continents WHERE continent = 'Europe');
SELECT MAX(horsepower), make FROM cars_data JOIN car_names ON cars_data.makeid = car_names.makeid JOIN model_list ON car_names.model = model_list.model JOIN car_makers ON model_list.maker = car_makers.id WHERE cylinders = 3;
SELECT horsepower, make FROM cars_data INNER JOIN car_names ON cars_data.makeid = car_names.makeid INNER JOIN model_list ON car_names.model = model_list.model WHERE cylinders = 3 ORDER BY horsepower DESC LIMIT 1;
SELECT model_list.model FROM model_list JOIN car_names ON model_list.maker = car_names.makeid JOIN cars_data ON car_names.makeid = cars_data.id ORDER BY cars_data.mpg DESC LIMIT 1;
SELECT c.model, cd.mpg FROM car_names c JOIN cars_data cd ON c.makeid = cd.id ORDER BY cd.mpg DESC LIMIT 1;
SELECT AVG(horsepower) FROM cars_data WHERE year < 1980;
SELECT AVG(horsepower) FROM cars_data WHERE year < 1980;
SELECT AVG(cars_data.edispl) FROM cars_data INNER JOIN car_names ON cars_data.makeid = car_names.makeid INNER JOIN model_list ON car_names.model = model_list.model INNER JOIN car_makers ON model_list.maker = car_makers.id WHERE car_makers.maker = 'volvo';
SELECT AVG(cars_data.edispl) FROM cars_data INNER JOIN car_names ON cars_data.makeid = car_names.makeid INNER JOIN model_list ON car_names.model = model_list.model INNER JOIN car_makers ON model_list.maker = car_makers.id WHERE car_makers.maker = 'volvo';
SELECT cylinders, MAX(accelerate) FROM cars_data GROUP BY cylinders;
SELECT MAX(accelerate) FROM cars_data WHERE cylinders IN (SELECT DISTINCT cylinders FROM cars_data);
SELECT model, COUNT(*) as count FROM car_names GROUP BY model ORDER BY count DESC LIMIT 1;
SELECT model, COUNT(DISTINCT make) as num_versions FROM car_names GROUP BY model ORDER BY num_versions DESC LIMIT 1;
SELECT COUNT(*) FROM cars_data WHERE cylinders > 4;
SELECT COUNT(*) FROM cars_data WHERE cylinders > 4;